app/controllers/students_controller.rb

  def create
    @student = Student.create(params.required(:student).permit(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-09-24 01:21:40.070945"], ["updated_at", "2018-09-24 01:21:40.070945"]]

  def update
    @student = set_student
    @student.update(params.required(:student).permit(:first_name, :last_name))
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-09-24 02:00:44.510949"], ["id", 1]]

  def set_student
    Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]